Revit 2027 API
TableSectionData.NumberOfColumns Property
 Gets or sets the number of items in column data array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfColumns { get; set; }
Public Property NumberOfColumns As Integer
	Get
	Set
public:
property int NumberOfColumns {
	int get ();
	void set (int value);
}
member NumberOfColumns : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: This operation is forbidden for cells in standard schedule body sections.
Remarks
 Note that TableSections may use either 0 or 1 as the first row and column indices. To access the rows and columns:
 Use FirstRowNumber and LastRowNumber to get the valid range of row indices.
 Use FirstColumnNumber and LastColumnNumber to get the valid range of column indices.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace